Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: *Ideal for Constrained Embedded and IoT devices:* Unlike a full Linux distribution, you can use the Yocto Project to create exactly what you need for embedded devices. You only add the feature support or packages that you absolutely need for the device. For devices that have display hardware, you can use available system components such as X11, Wayland, GTK+, Qt, Clutter, and SDL (among others) to create a rich user experience. For devices that do not have a display or where you want to use alternative UI frameworks, you can choose to not build these components.
it_it: *Ideale per dispositivi Embedded e IoT con Risorse Limitate:* A differenza di una distribuzione Linux completa, con Yocto Project è possibile creare esattamente ciò di cui si ha bisogno per i dispositivi embedded. È sufficiente aggiungere il supporto per le funzionalità o i pacchetti strettamente necessari al dispositivo. Per i dispositivi dotati di display, è possibile utilizzare componenti di sistema disponibili come X11, Wayland, GTK+, Qt, Clutter e SDL (tra gli altri) per creare un'esperienza utente ricca e intuitiva. Per i dispositivi sprovvisti di display o per i quali si desidera utilizzare framework UI alternativi, è possibile scegliere di non compilare questi componenti.

source: *Identify the bug or CVE to be fixed:* This information should be collected so that it can be included in your submission.
it_it: *Identificare il bug o la CVE da correggere:* Queste informazioni devono essere raccolte in modo da poter essere incluse nella richiesta di modifica.

source: *If the fix is not present in the master branch --- submit the fix to the master branch first:* This will ensure that the fix passes through the project's usual patch review and test processes before being accepted. It will also ensure that bugs are not left unresolved in the master branch itself. Once the fix is accepted in the master branch a backport request can be submitted as above.
it_it: *Se la correzione non è presente nel branch master, inviarla prima al branch master:* Questo garantirà che la correzione superi i normali processi di revisione e test delle patch del progetto prima di essere accettata. Inoltre, assicurerà che non rimangano bug irrisolti nel branch master stesso. Una volta che la correzione è stata accettata nel branch master, è possibile inviare una richiesta di backport come descritto sopra.

source: *If the fix is present in the master branch --- submit a backport request by email:* You should send an email to the relevant stable branch maintainer and the mailing list with details of the bug or CVE to be fixed, the commit hash on the master branch that fixes the issue and the stable branches which you would like this fix to be backported to.
it_it: *Se la correzione è presente nel branch master, inviare una richiesta di backport via email:* È necessario inviare un'e-mail al manutentore del branch stabile di riferimento e alla mailing list con i dettagli del bug o della CVE da correggere, l'hash del commit sul branch master che risolve il problema e i branch stabili su cui si desidera che la correzione venga retroportata.

source: *If the fix is unsuitable for the master branch --- submit a patch directly for the stable branch:* This method should be considered as a last resort. It is typically necessary when the master branch is using a newer version of the software which includes an upstream fix for the issue or when the issue has been fixed on the master branch in a way that introduces backwards incompatible changes. In this case follow the steps in ":ref:`contributor-guide/submit-changes:preparing changes for submission`" and in the following sections but modify the subject header of your patch email to include the name of the stable branch which you are targetting. This can be done using the ``--subject-prefix`` argument to ``git format-patch``, for example to submit a patch to the "wrynose" branch use::
it_it: *Se la correzione non è adatta al branch master, si invia una patch direttamente al branch stabile:* Questo metodo dovrebbe essere considerato come ultima risorsa. In genere è necessario quando il branch master utilizza una versione più recente del software che include una correzione upstream per il problema o quando il problema è stato risolto sul branch master in un modo che introduce modifiche incompatibili con le versioni precedenti. In questo caso, si seguono i passaggi descritti in ":ref:`contributor-guide/submit-changes:preparing changes for submission`" e nelle sezioni seguenti, ma si modifica l'oggetto dell'e-mail della patch includendo il nome del branch stabile a cui si sta indirizzando la patch. Questo può essere fatto utilizzando l'argomento ``--subject-prefix`` di ``git format-patch``, ad esempio per inviare una patch al branch "wrynose" utilizzare::

source: *Image Information:* This `video <https://www.youtube.com/watch?v=XqYGFsmA0Rw>`__ walks through the information Toaster provides about images: packages installed and root file system.
it_it: *Image Information:* Questo `video <https://www.youtube.com/watch?v=XqYGFsmA0Rw>`__ illustra le informazioni fornite da Toaster sulle immagini: pacchetti installati e file system root.

source: *Images and Code Transfer Easily:* Yocto Project output can easily move between architectures without moving to new development environments. Additionally, if you have used the Yocto Project to create an image or application and you find yourself not able to support it, commercial Linux vendors listed on :yocto_home:`/members/` and :yocto_home:`/about/participants/` could take it and provide ongoing support.
it_it: *Trasferimento Semplificato di Immagini e Codice:* L'output di Yocto Project può essere facilmente trasferito tra architetture senza dover passare a nuovi ambienti di sviluppo. Inoltre, se è stato utilizzato Yocto Project per creare un'immagine o un'applicazione e non si è più in grado di supportarla, i fornitori commerciali di Linux elencati su :yocto_home:`/members/` e :yocto_home:`/about/participants/` potrebbero prenderla in carico e fornire supporto continuo.

source: *Images:* Images produced by the workflow.
it_it: *Immagini:* Immagini prodotte dal flusso di lavoro.

source: *Information About the Build Process:* Toaster also records extensive information about your builds. Toaster collects data for builds you start from the web interface and from the command line as long as Toaster is running.
it_it: *Informazioni sul Processo di Build:* Toaster registra anche informazioni dettagliate sulle build. Toaster raccoglie dati per le build avviate dall'interfaccia web e dalla riga di comando, a condizione che Toaster sia in esecuzione.

source: *Initial Build Times Can be Significant:* Long initial build times are unfortunately unavoidable due to the large number of packages initially built from scratch for a fully functioning Linux system. Once that initial build is completed, however, the shared-state (sstate) cache mechanism Yocto Project uses keeps the system from rebuilding packages that have not been "touched" since the last build. The sstate mechanism significantly reduces times for successive builds.
it_it: *I Tempi di Compilazione Iniziali Possono Essere Significativi:* Tempi di compilazione iniziali lunghi sono purtroppo inevitabili a causa dell'elevato numero di pacchetti che vengono inizialmente compilati da zero per un sistema Linux completamente funzionante. Una volta completata la compilazione iniziale, tuttavia, il meccanismo di cache a shared-state (sstate) utilizzato da Yocto Project impedisce al sistema di ricompilare i pacchetti che non sono stati "modificati" dall'ultima compilazione. Il meccanismo sstate riduce significativamente i tempi per le compilazioni successive.

source: *Initialize the Build Environment:* While in the :term:`Source Directory`, run the :ref:`structure-core-script` environment setup script located in :term:`OpenEmbedded-Core (OE-Core)` to define the OpenEmbedded build environment on your build host. ::
it_it: *Inizializzazione dell'Ambiente di Build:* Mentre ci si trova nella directory :term:`Source Directory`, eseguire lo script di configurazione dell'ambiente :ref:`structure-core-script` che si trova in :term:`OpenEmbedded-Core (OE-Core)` per definire l'ambiente di build OpenEmbedded sul proprio host di build. ::

source: *Kernel Development:* If you are going to be developing kernels using the Yocto Project you likely will be using ``devtool``. A workflow using ``devtool`` makes kernel development quicker by reducing iteration cycle times.
it_it: *Sviluppo del Kernel:* Se si intende sviluppare kernel utilizzando Yocto Project, è probabile che si utilizzi ``devtool``. Un flusso di lavoro che utilizza ``devtool`` velocizza lo sviluppo del kernel riducendo i tempi del ciclo di iterazione.

source: *Layer Configuration File:* You must include a ``conf/layer.conf`` file in the ``meta-bsp_root_name`` directory. This file identifies the ``meta-bsp_root_name`` BSP layer as a layer to the build system.
it_it: *File di Configurazione del layer:* È necessario includere un file ``conf/layer.conf`` nella directory ``meta-bsp_root_name``. Questo file identifica il layer BSP ``meta-bsp_root_name`` come layer per il sistema di build.

source: *Layer Name:* The BSP must have a layer name that follows the Yocto Project standards. For information on BSP layer names, see the ":ref:`bsp-manual/bsp:bsp layers`" section.
it_it: *Nome del Layer:* Il BSP deve avere un nome di layer che rispetti gli standard di Yocto Project. Per informazioni sui nomi dei layer BSP, consultare la sezione ":ref:`bsp-manual/bsp:bsp layers`".

source: *Layer:* A collection of related metadata, which could include any of recipes, machine configuration files, distro configuration files and/or class files. Layers allow you to consolidate related metadata to customize your build. Layers also isolate information used when building for multiple architectures. Layers are hierarchical in their ability to override previous specifications. You can include any number of available layers from the Yocto Project and customize the build by adding your own layers after them. You can search the Layer Index for layers used within Yocto Project.
it_it: *Layer:* Una raccolta di metadati correlati, che può includere ricette, file di configurazione della macchina, file di configurazione della distribuzione e/o file di classe. I layer consentono di consolidare i metadati correlati per personalizzare la build. I layer isolano inoltre le informazioni utilizzate durante la compilazione per architetture multiple. I layer sono gerarchici e possono sovrascrivere le specifiche precedenti. È possibile includere un numero qualsiasi di layer disponibili da Yocto Project e personalizzare la build aggiungendo i propri layer. È possibile cercare i layer utilizzati all'interno di Yocto Project nell'Indice dei layer.

source: *License File:* You must include a license file in the ``meta-bsp_root_name`` directory. This license covers the BSP Metadata as a whole. You must specify which license to use since no default license exists. See the :yocto_git:`COPYING.MIT </meta-raspberrypi/tree/COPYING.MIT>` file for the Raspberry Pi BSP in the ``meta-raspberrypi`` BSP layer as an example.
it_it: *File di Licenza:* È necessario includere un file di licenza nella directory ``meta-bsp_root_name``. Questa licenza copre i metadati BSP nel loro complesso. È necessario specificare quale licenza utilizzare poiché non ne esiste una predefinita. Vedere il file :yocto_git:`COPYING.MIT </meta-raspberrypi/tree/COPYING.MIT>` per il BSP Raspberry Pi nel layer BSP ``meta-raspberrypi`` come esempio.

source: *License Manifest:* The Yocto Project provides a :ref:`license manifest <dev-manual/licenses:maintaining open source license compliance during your product's lifecycle>` for review by people who need to track the use of open source licenses (e.g. legal teams).
it_it: *Manifesto di Licenza:* Yocto Project fornisce un :ref:`license manifest <dev-manual/licenses:maintaining open source license compliance during your product's lifecycle>` da esaminare da parte di chi ha bisogno di tenere traccia dell'utilizzo delle licenze open source (ad esempio, i team legali).

source: *Local Yocto Project or Local OpenEmbedded:* This release causes your Toaster Projects to build against the head of the ``poky`` or ``openembedded-core`` clone you have local to the machine running Toaster.
it_it: *Local Yocto Project o Local OpenEmbedded:* Questa versione fa sì che i progetti Toaster vengano compilati utilizzando la versione più recente del clone di ``poky`` o ``openembedded-core`` che si ha in locale sulla macchina su cui è in esecuzione Toaster.

source: *Machine BSP Configuration:* Board Support Package (BSP) layers (i.e. "BSP Layer" in the following figure) providing machine-specific configurations. This type of information is specific to a particular target architecture. A good example of a BSP layer from the :ref:`overview-manual/yp-intro:reference embedded distribution (Poky)` is the :yocto_git:`meta-yocto-bsp </meta-yocto/tree/meta-yocto-bsp>` layer.
it_it: *Configurazione BSP della Macchina:* I layer del Board Support Package (BSP) (ovvero "BSP Layer" nella figura seguente) forniscono configurazioni specifiche per la macchina. Questo tipo di informazioni è specifico per una particolare architettura target . Un buon esempio di layer BSP dalla :ref:`overview-manual/yp-intro:reference embedded distribution (Poky)` è il layer :yocto_git:`meta-yocto-bsp </meta-yocto/tree/meta-yocto-bsp>`.

source: *Machine Configuration File:* You must include one or more ``conf/machine/bsp_root_name.conf`` files in the ``meta-bsp_root_name`` directory. These configuration files define machine targets that can be built using the BSP layer. Multiple machine configuration files define variations of machine configurations that the BSP supports. If a BSP supports multiple machine variations, you need to adequately describe each variation in the BSP ``README`` file. Do not use multiple machine configuration files to describe disparate hardware. If you do have very different targets, you should create separate BSP layers for each target.
it_it: *File di Configurazione della Macchina:* È necessario includere uno o più file ``conf/machine/bsp_root_name.conf`` nella directory ``meta-bsp_root_name``. Questi file di configurazione definiscono le macchine target compilabili utilizzando il layer BSP. Più file di configurazione della macchina definiscono le varianti di configurazione della macchina supportate dal BSP. Se un BSP supporta più varianti di macchina, è necessario descrivere adeguatamente ciascuna variante nel file ``README`` del BSP. Non utilizzare più file di configurazione della macchina per descrivere hardware eterogeneo. Se si hanno target molto diversi, è necessario creare layer BSP separati per ciascun target.

source: *Maintenance File:* Examine the ``maintainers.inc`` file, which is located in :term:`OpenEmbedded-Core (OE-Core)` at ``meta/conf/distro/include``, to see who is responsible for code.
it_it: *File di Manutenzione:* Esaminare il file ``maintainers.inc``, che si trova in :term:`OpenEmbedded-Core (OE-Core)` in ``meta/conf/distro/include``, per vedere chi è responsabile del codice.

source: *Make Complete Changes:* It is also good practice to leave the repository in a state that allows you to still successfully build your project. In other words, do not commit half of a feature, then add the other half as a separate, later commit. Each commit should take you from one buildable project state to another buildable state.
it_it: *Apportare Modifiche Complete:* È inoltre buona norma lasciare il repository in uno stato che consenta di compilare correttamente il progetto. In altre parole, non effettuate il commit di metà di una funzionalità per poi aggiungere l'altra metà con un commit separato in un secondo momento. Ogni commit dovrebbe portare da uno stato di progetto compilabile a un altro stato compilabile.

source: *Make Configuration Changes to Your New BSP Layer:* The standard BSP layer structure organizes the files you need to edit in ``conf`` and several ``recipes-*`` directories within the BSP layer. Configuration changes identify where your new layer is on the local system and identifies the kernel you are going to use. When you run the ``bitbake-layers`` script, you are able to interactively configure many things for the BSP (e.g. keyboard, touchscreen, and so forth).
it_it: *Modificare la Configurazione del Nuovo Layer BSP:* La struttura standard di un layer BSP organizza i file da modificare in ``conf`` e in diverse directory ``recipes-*`` all'interno del layer BSP. Le modifiche alla configurazione identificano la posizione del nuovo layer sul sistema locale e il kernel che si intende utilizzare. Eseguendo lo script ``bitbake-layers``, è possibile configurare interattivamente molti elementi del BSP (ad esempio, tastiera, touchscreen e così via).

source: *Make Recipe Changes to Your New BSP Layer:* Recipe changes include altering recipes (``*.bb`` files), removing recipes you do not use, and adding new recipes or append files (``.bbappend``) that support your hardware.
it_it: *Modificare le Ricette del Nuovo Layer BSP:* Le modifiche alle ricette includono la modifica delle ricette (file ``*.bb``), la rimozione delle ricette non utilizzate e l'aggiunta di nuove ricette o file di append (``.bbappend``) compatibili con l'hardware in uso.

source: *Make Small Changes:* It is best to keep the changes you commit small as compared to bundling many disparate changes into a single commit. This practice not only keeps things manageable but also allows the maintainer to more easily include or refuse changes.
it_it: *Apportare Piccole Modifiche:* È preferibile che le modifiche da sottoporre a commit siano di piccole dimensioni, piuttosto che raggruppare molte modifiche eterogenee in un unico commit. Questa pratica non solo semplifica la gestione, ma consente anche al manutentore di includere o rifiutare le modifiche con maggiore facilità.

source: *Make a Pull Request:* Notify the maintainer or the mailing list that you have pushed a change by making a pull request.
it_it: *Creare una Pull Request:* Notificare al manutentore o alla mailing list di aver inviato una modifica creando una pull request.

source: *Manage Branches:* Because branches are easy to use, you should use a system where branches indicate varying levels of code readiness. For example, you can have a "work" branch to develop in, a "test" branch where the code or change is tested, a "stage" branch where changes are ready to be committed, and so forth. As your project develops, you can merge code across the branches to reflect ever-increasing stable states of the development.
it_it: *Gestione dei Branch:* Poiché i branch sono facili da usare, è consigliabile utilizzare un sistema in cui i branch indichino diversi livelli di prontezza del codice. Ad esempio, è possibile avere un branch "work" per lo sviluppo, un branch "test" in cui il codice o la modifica vengono testati, un branch "stage" in cui le modifiche sono pronte per essere confermate e così via. Man mano che il progetto si sviluppa, è possibile unire il codice tra i branch per riflettere stati di sviluppo sempre più stabili.

source: *Matchbox:* Matchbox is an Open Source, base environment for the X Window System running on non-desktop, embedded platforms such as handhelds, set-top boxes, kiosks, and anything else for which screen space, input mechanisms, or system resources are limited.
it_it: *Matchbox:* Matchbox è un ambiente di base open source per X Window System, in esecuzione su piattaforme embedded non desktop come palmari, set-top box, chioschi e qualsiasi altro dispositivo in cui lo spazio sullo schermo, i meccanismi di input o le risorse di sistema siano limitati.

source: *Mechanism Rules Over Policy:* Focusing on mechanism rather than policy ensures that you are free to set policies based on the needs of your design instead of adopting decisions enforced by some system software provider.
it_it: *Meccanismo al éosto delle Politiche:* Concentrarsi sul meccanismo piuttosto che sulle politiche garantisce la libertà di definire le politiche in base alle esigenze del proprio progetto, anziché adottare decisioni imposte da un fornitore di software di sistema.

source: *Merge Changes:* The ``git merge`` command allows you to take the changes from one branch and fold them into another branch. This process is especially helpful when more than a single developer might be working on different parts of the same feature. Merging changes also automatically identifies any collisions or "conflicts" that might happen as a result of the same lines of code being altered by two different developers.
it_it: *Merge delle Modifiche:* Il comando ``git merge`` consente di unire le modifiche da un branch a un altro. Questo processo è particolarmente utile quando più sviluppatori lavorano su parti diverse della stessa funzionalità. L'unione [merging] delle modifiche identifica automaticamente anche eventuali collisioni o "conflitti" che potrebbero verificarsi a seguito della modifica delle stesse righe di codice da parte di due sviluppatori diversi.

source: *Metadata (.bb + Patches):* Software layers containing user-supplied recipe files, patches, and append files. A good example of a software layer might be the :oe_layer:`meta-qt5 layer ` from the :oe_layerindex:`OpenEmbedded Layer Index <>`. This layer is for version 5.0 of the popular `Qt <https://wiki.qt.io/About_Qt>`__ cross-platform application development framework for desktop, embedded and mobile.
it_it: *Metadata (.bb + Patches):* Layer software contenenti file di ricette, patch e file di append forniti dall'utente. Un buon esempio di layer software potrebbe essere il layer :oe_layer:`meta-qt5 layer ` dall' :oe_layerindex:`OpenEmbedded Layer Index <>`. Questo layer è per la versione 5.0 del popolare framework di sviluppo di applicazioni multipiattaforma `Qt <https://wiki.qt.io/About_Qt>`__ per desktop, sistemi embedded e dispositivi mobili.

source: *Metadata Layers:* Various layers that provide software, machine, and distro metadata.
it_it: *Layer di metadati:* Vari layer che forniscono metadati relativi a software, macchine e distribuzioni.
